# -*- coding: utf-8 -*-
"""

@author: EGrandgi

"""


from bs4 import BeautifulSoup
import requests
import pandas as pd
import csv



# =============================================================================
#                                 Functions
# =============================================================================


def create_soup(url, enc):
    """ 
        In: url
        Out: source code  
    """

    req = requests.get(url)
    data = req.text
    soup = BeautifulSoup(data, from_encoding=enc)

    return soup



def basic_cleaner(s):

    in_ = [':', "\'", '\s+', 'é', 'è', 'ë', 'ê', 'à', 'â', 'ä', 'î', 'ï', 'ô', 'ö', 'œ', 'æ', 'û', 'ü', 'ù', 'ú', 'ç', 'À', 'Â', 'É', 'È', 'Ê', 'Ë', 'Î', 'Ï', 'Ô', 'Ö', 'Ù', 'Û', 'Ü', 'Ç', 'Œ', 'Æ', 'Ã©', 'Ã¨', 'Ã¯', 'Ã´',
           'Ã§', 'Ãª', 'Ã¹', 'Ã¦', 'Å', 'Ã«', 'Ã¼', 'Ã¢', 'â¬', 'Â©', 'Ã', 'Ã®', 'Ã¶', 'Ã»', 'Å', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Ã', 'Å', '\t', '\n', '\x92', '-', '/', 'Ãº', '« ', ' »', '"', '(...)', '(', ')', '  ']

    out_ = ['', ' ', ' ', 'e', 'e', 'e', 'e', 'a', 'a', 'a', 'i', 'i', 'o', 'o', 'oe', 'ae', 'u', 'u', 'u', 'u', 'c', 'a', 'a', 'e', 'e', 'e', 'e', 'i', 'i', 'o', 'o', 'u', 'u', 'u', 'c', 'oe', 'ae', 'e', 'e', 'i',
            'o', 'c', 'e', 'u', 'ae', 'oe', 'e', 'u', 'a', 'e', 'c', 'a', 'i', 'o', 'u', 'oe', 'A', 'A', 'E', 'E', 'E', 'E', 'I', 'I', 'O', 'O', 'U', 'U', 'U', 'C', 'OE', '', '', '', ' ', '', 'u', '', '', '', '', '', '', ' ']

    for j in range(len(in_)):
        s = s.replace(in_[j], out_[j])

    s = s.lower()

    return s
